"""Данные о единицах измерения массы"""

UNITS_MASS = {
    'kg': {
        'factor': 1, 
        'aliases': [
            'kg', 'кг', 'килограмм', 'килограммов', 
            'килограммах'
            ]
    },
    'g': {
        'factor': 0.001, 
        'aliases': [
            'g', 'г', 'грамм', 'граммов', 
            'граммах'
            ]
    },
    'mg': {
        'factor': 0.000001, 
        'aliases': [
            'mg', 'мг', 'миллиграмм', 'миллиграммов', 
            'миллиграммах'
            ]
    },
}
