"""Данные о единицах измерения массы"""

UNITS_MASS_RU = {
    't': {
        'factor': 1000,
        'aliases': [
            't', 'tons', 'т', 'тонна', 'тонны',
            'тонн', 'тоннах', 'тонне'
            ]
    },
    'q': {
        'factor': 100,
        'aliases': [
            'q', 'hundredweight', 'centner', 'ц', 'центнер', 'центнера',
            'центнеров', 'центнерах', 'центнеры'
            ]
    },
    'kg': {
        'factor': 1,
        'aliases': [
            'kg', 'kilogram', 'кг', 'килограмм', 'килограмма',
            'килограммов', 'килограммах', 'килограммы'
            ]
    },
    'g': {
        'factor': 0.001,
        'aliases': [
            'g', 'gram', 'г', 'грамм', 'грамма',
            'граммов', 'граммах', 'граммы'
            ]
    },
    'mg': {
        'factor': 0.000001,
        'aliases': [
            'mg', 'milligrams', 'мг', 'миллиграмм', 'миллиграмма',
            'миллиграммов', 'миллиграммах', 'миллиграммы'
            ]
    },
}

UNITS_MASS_EN = {
    'st': {
        'factor': 6.35029,
        'aliases': [
            'st', 'stone', 'stones', 'стоун',
            'стоуна', 'стоунов', 'стоунах', 'стоуны'
            ]
    },
    'lb': {
        'factor': 0.453592,
        'aliases': [
            'lb', 'pound', 'pounds', 'фунт',
            'фунта', 'фунтов', 'фунтах', 'фунты'
            ]
    },
    'oz': {
        'factor': 0.0283495,
        'aliases': [
            'oz', 'ounce', 'ounces', 'унция',
            'унции', 'унций', 'унциях', 'унции'
            ]
    },
}
