"""Данные о единицах измерения длины"""

UNITS_DISTANCE_RU = {
    'km': {
        'factor': 1000,
        'aliases': [
            'km', 'км', 'километр', 'километров',
            'километрах', 'километры'
            ]
    },
    'm': {
        'factor': 1,
        'aliases': [
            'm', 'meter', 'м', 'метров',
            'метр', 'метры', 'метрах'
            ]
    },
    'dm': {
        'factor': 0.1,
        'aliases': [
            'dm', 'дм', 'дециметр', 'дециметры',
            'дециметров', 'дециметрах'
            ]
    },
    'cm': {
        'factor': 0.01,
        'aliases': [
            'cm', 'см', 'сантиметр', 'сантиметры',
            'сантиметров', 'сантиметрах'
            ]
    },
    'mm': {
        'factor': 0.001,
        'aliases': [
            'mm', 'мм', 'миллиметр', 'миллиметры',
            'миллиметров', 'миллиметрах'
            ]
    },
}

UNITS_DISTANCE_EN = {
    'mi': {
        'factor': 1609.344,
        'aliases': [
            'mi', 'mile', 'miles', 'миля', 'мили',
            'миль', 'милях'
            ]
    },
    'yd': {
        'factor': 0.9144,
        'aliases': [
            'yd', 'yard', 'yards', 'ярд', 'ярда',
            'ярдов', 'ярдах', 'ярды'
            ]
    },
    'ft': {
        'factor': 0.3048,
        'aliases': [
            'ft', 'foot', 'feet', 'фут', 'фута',
            'футов', 'футах', 'футы'
            ]
    },
    'in': {
        'factor': 0.0254,
        'aliases': [
            'in', 'inch', 'inches', 'дюйм', 'дюйма',
            'дюймов', 'дюймах', 'дюймы'
            ]
    },
}
