"""Данные о единицах измерения времени"""

UNITS_TIME = {
    'h': {
        'factor': 3600, 
        'aliases': [
            'h', 'ч', 'час', 'часы', 
            'часов', 'часа', 'часах'
            ]
    },
    'min': {
        'factor': 60, 
        'aliases': [
            'min', 'мин', 'минута', 'минут', 
            'минуты', 'минутах'
            ]
    },
    's': {
        'factor': 1, 
        'aliases': [
            's', 'сек', 'секунд', 'секунда', 
            'секундах', 'секунды'
            ]
    },
    'ms': {
        'factor': 0.001, 
        'aliases': [
            'ms', 'мс', 'миллисек', 'миллисекунд', 
            'миллисекунда', 'миллисекундах'
            ]
    },
}
